Revit 2024 API
PartMakerMethodToDivideVolumes Methods
The PartMakerMethodToDivideVolumes type exposes the following members.
Methods
Name | Description
AddIntersectingReference
 Adds intersecting reference with an offset.
AreElementsValidIntersectingReferences(ICollection<ElementId>)
 Identifies if provided members are valid.
AreElementsValidIntersectingReferences(Document, ICollection<ElementId>)
 Identifies if provided members are valid.
CanBeDivisionProfile(ElementId)
 Checks whether a family defines a profile which can be used by this method.
CanBeDivisionProfile(ElementId, Document)
 Checks whether a family defines a profile which can be used by this method.
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetOffsetForIntersectingReference
 Gets offset for the intersecting reference.
GetPlaneOfSketch
 Gets the plane of the sketch.
GetSketchCurves
 Populates the array with copies of curves in the sketch.
GetSplitRefsOffsets
 Returns offsets for plane-defining splitters.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsElementValidIntersectingReference(ElementId)
 Identifies if the provided member is valid.
IsElementValidIntersectingReference(Document, ElementId)
 Identifies if the provided member is valid.
IsValidSketchPlane
 Identifies if provided sketch plane is valid.
RemoveIntersectingReference
 Removed intersecting reference.
SetOffsetForIntersectingReference
 Sets offset for the intersecting reference.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
UsesReference
 Identifies if the PartMaker uses the intersecting reference.
See Also
PartMakerMethodToDivideVolumes Class
Autodesk.Revit.DB Namespace